#常见错误：1.拼写错误 2.大小写错误 3.中文符号
#知识点：
#1.python程序是.py文件 
#2.执行程序: python mai.py
#3.print是一个函数，用来打印输入
#4.要打印的内容成为参数，参数一定要放在括号里面
#5.字符串一定要用引号引起来，可以是单引号，也可以是双引号，还可以是三引号
#6.三引号括起来的字符串才可以换行，可以是3个单引号，也可以是3个双引号
print('''      \_/
     (* *)
    __)#(__
   ( )...( )(_)
   || |_| ||//
>==() | | ()/
    _(___)_
   [-]小麦[-]''')
#1.变量就是在内存中分配的一个小盒子，后面可以用变量的名字来使用它里面的值
#2.字符串可以通过+号来拼接。可以把字符串和变量拼接在一起。
#3.变量的名字通常小写，如果比较长的名字，用下划线链接起来
name = '麦叔'
robot_name = '小麦'

#1.引入另外一个文件/模块/module import
#2.一个变量它是有范围的，它只能在一个文件内用，除非通过参数传递过去
#3.函数可以有参数
import openning 
openning.hello(name, robot_name) 








